mongo_a_load_150000.txt
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-08 23:42:22:643 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-08 23:42:32:624 10 sec: 57214 operations; 5721.4 current ops/sec; est completion in 17 seconds [INSERT: Count=57214, Max=171647, Min=98, Avg=158.95, 90=203, 99=455, 99.9=3077, 99.99=6819] 
2018-12-08 23:42:42:624 20 sec: 132069 operations; 7485.5 current ops/sec; est completion in 3 second [INSERT: Count=74855, Max=84479, Min=100, Avg=131.07, 90=151, 99=235, 99.9=1287, 99.99=7307] 
2018-12-08 23:42:45:056 22 sec: 150000 operations; 7369.91 current ops/sec; [CLEANUP: Count=1, Max=5579, Min=5576, Avg=5578, 90=5579, 99=5579, 99.9=5579, 99.99=5579] [INSERT: Count=17931, Max=7263, Min=100, Avg=133.22, 90=152, 99=245, 99.9=1498, 99.99=5683] 
[OVERALL], RunTime(ms), 22440
[OVERALL], Throughput(ops/sec), 6684.491978609625
[TOTAL_GCS_PS_Scavenge], Count, 55
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 87
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3877005347593583
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 55
[TOTAL_GC_TIME], Time(ms), 87
[TOTAL_GC_TIME_%], Time(%), 0.3877005347593583
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5578.0
[CLEANUP], MinLatency(us), 5576
[CLEANUP], MaxLatency(us), 5579
[CLEANUP], 95thPercentileLatency(us), 5579
[CLEANUP], 99thPercentileLatency(us), 5579
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 141.96139333333332
[INSERT], MinLatency(us), 98
[INSERT], MaxLatency(us), 171647
[INSERT], 95thPercentileLatency(us), 203
[INSERT], 99thPercentileLatency(us), 322
[INSERT], Return=OK, 150000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 02:14:51:770 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 02:15:01:717 10 sec: 53278 operations; 5327.8 current ops/sec; est completion in 19 seconds [INSERT: Count=53278, Max=500479, Min=100, Avg=172.72, 90=201, 99=448, 99.9=2349, 99.99=7091] 
2018-12-09 02:15:11:717 20 sec: 118989 operations; 6571.1 current ops/sec; est completion in 6 second [INSERT: Count=65711, Max=1730559, Min=94, Avg=149.47, 90=143, 99=219, 99.9=828, 99.99=6167] 
2018-12-09 02:15:15:898 24 sec: 150000 operations; 7415.35 current ops/sec; [CLEANUP: Count=1, Max=1820, Min=1820, Avg=1820, 90=1820, 99=1820, 99.9=1820, 99.99=1820] [INSERT: Count=31011, Max=6995, Min=100, Avg=132.65, 90=154, 99=240, 99.9=1257, 99.99=6523] 
[OVERALL], RunTime(ms), 24185
[OVERALL], Throughput(ops/sec), 6202.191440975811
[TOTAL_GCS_PS_Scavenge], Count, 52
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 72
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2977051891668389
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 52
[TOTAL_GC_TIME], Time(ms), 72
[TOTAL_GC_TIME_%], Time(%), 0.2977051891668389
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1820.0
[CLEANUP], MinLatency(us), 1820
[CLEANUP], MaxLatency(us), 1820
[CLEANUP], 95thPercentileLatency(us), 1820
[CLEANUP], 99thPercentileLatency(us), 1820
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 154.24819333333335
[INSERT], MinLatency(us), 94
[INSERT], MaxLatency(us), 1730559
[INSERT], 95thPercentileLatency(us), 200
[INSERT], 99thPercentileLatency(us), 280
[INSERT], Return=OK, 150000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 04:16:13:746 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 04:16:23:699 10 sec: 40080 operations; 4008 current ops/sec; est completion in 28 seconds [INSERT: Count=40080, Max=710655, Min=98, Avg=230.79, 90=236, 99=550, 99.9=3431, 99.99=10231] 
2018-12-09 04:16:33:699 20 sec: 103131 operations; 6305.1 current ops/sec; est completion in 10 seconds [INSERT: Count=63051, Max=1793023, Min=90, Avg=155.62, 90=147, 99=227, 99.9=976, 99.99=6651] 
2018-12-09 04:16:39:462 25 sec: 150000 operations; 8132.74 current ops/sec; [CLEANUP: Count=1, Max=1959, Min=1959, Avg=1959, 90=1959, 99=1959, 99.9=1959, 99.99=1959] [INSERT: Count=46869, Max=10831, Min=96, Avg=120.96, 90=144, 99=226, 99.9=810, 99.99=4959] 
[OVERALL], RunTime(ms), 25763
[OVERALL], Throughput(ops/sec), 5822.303303186741
[TOTAL_GCS_PS_Scavenge], Count, 22
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 64
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2484182742693009
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 22
[TOTAL_GC_TIME], Time(ms), 64
[TOTAL_GC_TIME_%], Time(%), 0.2484182742693009
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1959.0
[CLEANUP], MinLatency(us), 1959
[CLEANUP], MaxLatency(us), 1959
[CLEANUP], 95thPercentileLatency(us), 1959
[CLEANUP], 99thPercentileLatency(us), 1959
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 164.87664666666666
[INSERT], MinLatency(us), 90
[INSERT], MaxLatency(us), 1793023
[INSERT], 95thPercentileLatency(us), 220
[INSERT], 99thPercentileLatency(us), 311
[INSERT], Return=OK, 150000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:04:23:328 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 05:04:33:166 10 sec: 3945 operations; 394.5 current ops/sec; est completion in 6 minutes [INSERT: Count=3945, Max=600063, Min=213, Avg=1781.33, 90=2975, 99=8975, 99.9=18895, 99.99=600063] 
2018-12-09 05:04:43:166 20 sec: 14290 operations; 1034.5 current ops/sec; est completion in 3 minutes [INSERT: Count=10346, Max=20015, Min=165, Avg=950.67, 90=1189, 99=5319, 99.9=10431, 99.99=17567] 
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:04:45:475 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 05:04:53:166 30 sec: 28436 operations; 1414.6 current ops/sec; est completion in 2 minutes [INSERT: Count=14146, Max=1116159, Min=122, Avg=697.28, 90=922, 99=4159, 99.9=9247, 99.99=22479] 
2018-12-09 05:04:55:445 10 sec: 4961 operations; 496.1 current ops/sec; est completion in 4 minutes [INSERT: Count=4961, Max=232447, Min=198, Avg=1535.58, 90=3039, 99=8623, 99.9=18287, 99.99=232447] 
2018-12-09 05:05:03:166 40 sec: 45586 operations; 1715 current ops/sec; est completion in 1 minute [INSERT: Count=17150, Max=106047, Min=113, Avg=576.91, 90=812, 99=4049, 99.9=11959, 99.99=23647] 
2018-12-09 05:05:05:445 20 sec: 15160 operations; 1019.9 current ops/sec; est completion in 2 minutes [INSERT: Count=10200, Max=32399, Min=123, Avg=965.67, 90=1374, 99=5531, 99.9=12631, 99.99=19311] 
Exception while trying bulk insert with 0
com.mongodb.MongoWriteException: E11000 duplicate key error collection: ycsb.usertable index: _id_ dup key: { : "user8925468001924465020" }
	at com.mongodb.MongoCollectionImpl.executeSingleWriteRequest(MongoCollectionImpl.java:1033)
	at com.mongodb.MongoCollectionImpl.executeInsertOne(MongoCollectionImpl.java:513)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:493)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:487)
	at com.yahoo.ycsb.db.MongoDbClient.insert(MongoDbClient.java:270)
	at com.yahoo.ycsb.DBWrapper.insert(DBWrapper.java:221)
	at com.yahoo.ycsb.workloads.CoreWorkload.doInsert(CoreWorkload.java:562)
	at com.yahoo.ycsb.ClientThread.run(Client.java:468)
	at java.lang.Thread.run(Thread.java:748)
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
2018-12-09 05:05:06:192 20 sec: 16107 operations; 1267.74 current ops/sec; est completion in 2 minutes [CLEANUP: Count=1, Max=18463, Min=18448, Avg=18456, 90=18463, 99=18463, 99.9=18463, 99.99=18463] [INSERT: Count=946, Max=12415, Min=151, Avg=681.41, 90=1061, 99=6159, 99.9=11999, 99.99=12415] [INSERT-FAILED: Count=1, Max=67327, Min=67264, Avg=67296, 90=67327, 99=67327, 99.9=67327, 99.99=67327] 
[OVERALL], RunTime(ms), 20747
[OVERALL], Throughput(ops/sec), 776.3532076926784
[TOTAL_GCS_PS_Scavenge], Count, 15
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 73
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.35185809996626016
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 73
[TOTAL_GC_TIME_%], Time(%), 0.35185809996626016
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 18456.0
[CLEANUP], MinLatency(us), 18448
[CLEANUP], MaxLatency(us), 18463
[CLEANUP], 95thPercentileLatency(us), 18463
[CLEANUP], 99thPercentileLatency(us), 18463
[INSERT], Operations, 16107
[INSERT], AverageLatency(us), 1124.505308251071
[INSERT], MinLatency(us), 123
[INSERT], MaxLatency(us), 232447
[INSERT], 95thPercentileLatency(us), 3279
[INSERT], 99thPercentileLatency(us), 6827
[INSERT], Return=OK, 16107
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1
[INSERT-FAILED], AverageLatency(us), 67296.0
[INSERT-FAILED], MinLatency(us), 67264
[INSERT-FAILED], MaxLatency(us), 67327
[INSERT-FAILED], 95thPercentileLatency(us), 67327
[INSERT-FAILED], 99thPercentileLatency(us), 67327
Exception while trying bulk insert with 0
com.mongodb.MongoWriteException: E11000 duplicate key error collection: ycsb.usertable index: _id_ dup key: { : "user6028465272298022064" }
	at com.mongodb.MongoCollectionImpl.executeSingleWriteRequest(MongoCollectionImpl.java:1033)
	at com.mongodb.MongoCollectionImpl.executeInsertOne(MongoCollectionImpl.java:513)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:493)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:487)
	at com.yahoo.ycsb.db.MongoDbClient.insert(MongoDbClient.java:270)
	at com.yahoo.ycsb.DBWrapper.insert(DBWrapper.java:221)
	at com.yahoo.ycsb.workloads.CoreWorkload.doInsert(CoreWorkload.java:562)
	at com.yahoo.ycsb.ClientThread.run(Client.java:468)
	at java.lang.Thread.run(Thread.java:748)
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
2018-12-09 05:05:12:010 48 sec: 63958 operations; 2077.34 current ops/sec; est completion in 1 minute [CLEANUP: Count=1, Max=11543, Min=11536, Avg=11540, 90=11543, 99=11543, 99.9=11543, 99.99=11543] [INSERT: Count=18371, Max=25711, Min=116, Avg=465.38, 90=712, 99=4307, 99.9=10807, 99.99=17711] [INSERT-FAILED: Count=1, Max=120703, Min=120640, Avg=120672, 90=120703, 99=120703, 99.9=120703, 99.99=120703] 
[OVERALL], RunTime(ms), 48844
[OVERALL], Throughput(ops/sec), 1309.4341167799525
[TOTAL_GCS_PS_Scavenge], Count, 50
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 122
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.24977479321922857
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 50
[TOTAL_GC_TIME], Time(ms), 122
[TOTAL_GC_TIME_%], Time(%), 0.24977479321922857
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 11540.0
[CLEANUP], MinLatency(us), 11536
[CLEANUP], MaxLatency(us), 11543
[CLEANUP], 95thPercentileLatency(us), 11543
[CLEANUP], 99thPercentileLatency(us), 11543
[INSERT], Operations, 63958
[INSERT], AverageLatency(us), 706.2492729603803
[INSERT], MinLatency(us), 113
[INSERT], MaxLatency(us), 1116159
[INSERT], 95thPercentileLatency(us), 1718
[INSERT], 99thPercentileLatency(us), 4891
[INSERT], Return=OK, 63958
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1
[INSERT-FAILED], AverageLatency(us), 120672.0
[INSERT-FAILED], MinLatency(us), 120640
[INSERT-FAILED], MaxLatency(us), 120703
[INSERT-FAILED], 95thPercentileLatency(us), 120703
[INSERT-FAILED], 99thPercentileLatency(us), 120703
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:05:45:021 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 05:05:54:878 10 sec: 6861 operations; 686.1 current ops/sec; est completion in 3 minutes [INSERT: Count=6861, Max=334079, Min=191, Avg=1063.85, 90=2000, 99=6947, 99.9=11311, 99.99=21039] 
2018-12-09 05:06:04:878 20 sec: 20308 operations; 1344.7 current ops/sec; est completion in 2 minutes [INSERT: Count=13447, Max=31391, Min=176, Avg=730.24, 90=983, 99=4315, 99.9=8351, 99.99=28767] 
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:06:09:795 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 05:06:14:878 30 sec: 38568 operations; 1826 current ops/sec; est completion in 1 minute [INSERT: Count=18260, Max=465151, Min=117, Avg=539.58, 90=722, 99=3019, 99.9=7191, 99.99=15015] 
2018-12-09 05:06:19:755 10 sec: 7709 operations; 770.82 current ops/sec; est completion in 3 minutes [INSERT: Count=7714, Max=272639, Min=194, Avg=1131.68, 90=1586, 99=4515, 99.9=12439, 99.99=92095] 
2018-12-09 05:06:24:878 40 sec: 63111 operations; 2454.3 current ops/sec; est completion in 56 seconds [INSERT: Count=24543, Max=90239, Min=119, Avg=401.59, 90=580, 99=1439, 99.9=6015, 99.99=11183] 
2018-12-09 05:06:29:755 20 sec: 22643 operations; 1493.4 current ops/sec; est completion in 1 minute [INSERT: Count=14929, Max=19823, Min=140, Avg=654, 90=958, 99=2519, 99.9=8727, 99.99=17887] 
Exception while trying bulk insert with 0
com.mongodb.MongoWriteException: E11000 duplicate key error collection: ycsb.usertable index: _id_ dup key: { : "user6939087591399168323" }
	at com.mongodb.MongoCollectionImpl.executeSingleWriteRequest(MongoCollectionImpl.java:1033)
	at com.mongodb.MongoCollectionImpl.executeInsertOne(MongoCollectionImpl.java:513)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:493)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:487)
	at com.yahoo.ycsb.db.MongoDbClient.insert(MongoDbClient.java:270)
	at com.yahoo.ycsb.DBWrapper.insert(DBWrapper.java:221)
	at com.yahoo.ycsb.workloads.CoreWorkload.doInsert(CoreWorkload.java:562)
	at com.yahoo.ycsb.ClientThread.run(Client.java:468)
	at java.lang.Thread.run(Thread.java:748)
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
2018-12-09 05:06:33:607 23 sec: 28264 operations; 1459.24 current ops/sec; est completion in 1 minute [CLEANUP: Count=1, Max=17935, Min=17920, Avg=17928, 90=17935, 99=17935, 99.9=17935, 99.99=17935] [INSERT: Count=5621, Max=16703, Min=124, Avg=652.52, 90=1060, 99=3495, 99.9=10935, 99.99=16559] [INSERT-FAILED: Count=1, Max=99647, Min=99584, Avg=99616, 90=99647, 99=99647, 99.9=99647, 99.99=99647] 
[OVERALL], RunTime(ms), 23853
[OVERALL], Throughput(ops/sec), 1184.9243281767492
[TOTAL_GCS_PS_Scavenge], Count, 14
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 50
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.20961723892172893
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 14
[TOTAL_GC_TIME], Time(ms), 50
[TOTAL_GC_TIME_%], Time(%), 0.20961723892172893
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 17928.0
[CLEANUP], MinLatency(us), 17920
[CLEANUP], MaxLatency(us), 17935
[CLEANUP], 95thPercentileLatency(us), 17935
[CLEANUP], 99thPercentileLatency(us), 17935
[INSERT], Operations, 28264
[INSERT], AverageLatency(us), 784.0773775827909
[INSERT], MinLatency(us), 124
[INSERT], MaxLatency(us), 272639
[INSERT], 95thPercentileLatency(us), 1538
[INSERT], 99thPercentileLatency(us), 3473
[INSERT], Return=OK, 28264
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1
[INSERT-FAILED], AverageLatency(us), 99616.0
[INSERT-FAILED], MinLatency(us), 99584
[INSERT-FAILED], MaxLatency(us), 99647
[INSERT-FAILED], 95thPercentileLatency(us), 99647
[INSERT-FAILED], 99thPercentileLatency(us), 99647
2018-12-09 05:06:34:878 50 sec: 85874 operations; 2276.3 current ops/sec; est completion in 38 seconds [INSERT: Count=22763, Max=30191, Min=103, Avg=435.17, 90=632, 99=2427, 99.9=8119, 99.99=21215] 
2018-12-09 05:06:44:878 60 sec: 94359 operations; 848.5 current ops/sec; est completion in 36 seconds [INSERT: Count=8485, Max=2922495, Min=110, Avg=1175.02, 90=622, 99=3007, 99.9=10087, 99.99=2142207] 
2018-12-09 05:06:54:878 70 sec: 114816 operations; 2045.7 current ops/sec; est completion in 22 seconds [INSERT: Count=20457, Max=553983, Min=122, Avg=485.24, 90=621, 99=3823, 99.9=7403, 99.99=16495] 
2018-12-09 05:07:04:878 80 sec: 132897 operations; 1808.1 current ops/sec; est completion in 11 seconds [INSERT: Count=18081, Max=37727, Min=127, Avg=491.83, 90=782, 99=3623, 99.9=7739, 99.99=22751] 
2018-12-09 05:07:13:099 88 sec: 150000 operations; 2080.66 current ops/sec; [CLEANUP: Count=1, Max=14223, Min=14216, Avg=14220, 90=14223, 99=14223, 99.9=14223, 99.99=14223] [INSERT: Count=17103, Max=1047551, Min=119, Avg=536.21, 90=735, 99=3517, 99.9=9023, 99.99=16007] 
[OVERALL], RunTime(ms), 88221
[OVERALL], Throughput(ops/sec), 1700.2754446220288
[TOTAL_GCS_PS_Scavenge], Count, 113
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 161
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.18249623105609777
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 113
[TOTAL_GC_TIME], Time(ms), 161
[TOTAL_GC_TIME_%], Time(%), 0.18249623105609777
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 14220.0
[CLEANUP], MinLatency(us), 14216
[CLEANUP], MaxLatency(us), 14223
[CLEANUP], 95thPercentileLatency(us), 14223
[CLEANUP], 99thPercentileLatency(us), 14223
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 564.6243866666666
[INSERT], MinLatency(us), 103
[INSERT], MaxLatency(us), 2922495
[INSERT], 95thPercentileLatency(us), 1023
[INSERT], 99thPercentileLatency(us), 3839
[INSERT], Return=OK, 150000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:08:21:465 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Exception while trying bulk insert with 0
com.mongodb.MongoWriteException: E11000 duplicate key error collection: ycsb.usertable index: _id_ dup key: { : "user6284781860667377211" }
	at com.mongodb.MongoCollectionImpl.executeSingleWriteRequest(MongoCollectionImpl.java:1033)
	at com.mongodb.MongoCollectionImpl.executeInsertOne(MongoCollectionImpl.java:513)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:493)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:487)
	at com.yahoo.ycsb.db.MongoDbClient.insert(MongoDbClient.java:270)
	at com.yahoo.ycsb.DBWrapper.insert(DBWrapper.java:221)
	at com.yahoo.ycsb.workloads.CoreWorkload.doInsert(CoreWorkload.java:562)
	at com.yahoo.ycsb.ClientThread.run(Client.java:468)
	at java.lang.Thread.run(Thread.java:748)
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
2018-12-09 05:08:25:779 4 sec: 0 operations; est completion in 106751991167300 days 15 hours [CLEANUP: Count=1, Max=13191, Min=13184, Avg=13188, 90=13191, 99=13191, 99.9=13191, 99.99=13191] [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT-FAILED: Count=1, Max=622591, Min=622080, Avg=622336, 90=622591, 99=622591, 99.9=622591, 99.99=622591] 
[OVERALL], RunTime(ms), 4510
[OVERALL], Throughput(ops/sec), 0.0
[TOTAL_GCS_PS_Scavenge], Count, 2
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 35
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.7760532150776054
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 35
[TOTAL_GC_TIME_%], Time(%), 0.7760532150776054
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 13188.0
[CLEANUP], MinLatency(us), 13184
[CLEANUP], MaxLatency(us), 13191
[CLEANUP], 95thPercentileLatency(us), 13191
[CLEANUP], 99thPercentileLatency(us), 13191
[INSERT], Operations, 0
[INSERT], AverageLatency(us), NaN
[INSERT], MinLatency(us), 9223372036854775807
[INSERT], MaxLatency(us), 0
[INSERT], 95thPercentileLatency(us), 0
[INSERT], 99thPercentileLatency(us), 0
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1
[INSERT-FAILED], AverageLatency(us), 622336.0
[INSERT-FAILED], MinLatency(us), 622080
[INSERT-FAILED], MaxLatency(us), 622591
[INSERT-FAILED], 95thPercentileLatency(us), 622591
[INSERT-FAILED], 99thPercentileLatency(us), 622591
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-13 10:39:23:432 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-13 10:39:33:377 10 sec: 8631 operations; 863.1 current ops/sec; est completion in 2 minutes [INSERT: Count=8631, Max=7217151, Min=173, Avg=1089.88, 90=284, 99=1087, 99.9=5387, 99.99=11599] 
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-17 16:18:58:178 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-17 16:19:08:125 10 sec: 44879 operations; 4487.9 current ops/sec; est completion in 24 seconds [INSERT: Count=44879, Max=775167, Min=94, Avg=203.56, 90=225, 99=503, 99.9=2959, 99.99=9575] 
2018-12-17 16:19:18:125 20 sec: 117764 operations; 7288.5 current ops/sec; est completion in 6 second [INSERT: Count=72891, Max=11583, Min=86, Avg=134.5, 90=163, 99=259, 99.9=1162, 99.99=5791] 
2018-12-17 16:19:22:801 24 sec: 150000 operations; 6892.45 current ops/sec; [CLEANUP: Count=1, Max=2319, Min=2318, Avg=2319, 90=2319, 99=2319, 99.9=2319, 99.99=2319] [INSERT: Count=32230, Max=120895, Min=93, Avg=142.84, 90=170, 99=273, 99.9=1261, 99.99=5643] 
[OVERALL], RunTime(ms), 24677
[OVERALL], Throughput(ops/sec), 6078.534667909389
[TOTAL_GCS_PS_Scavenge], Count, 51
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 76
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3079790898407424
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 51
[TOTAL_GC_TIME], Time(ms), 76
[TOTAL_GC_TIME_%], Time(%), 0.3079790898407424
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2319.0
[CLEANUP], MinLatency(us), 2318
[CLEANUP], MaxLatency(us), 2319
[CLEANUP], 95thPercentileLatency(us), 2319
[CLEANUP], 99thPercentileLatency(us), 2319
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 156.95448
[INSERT], MinLatency(us), 86
[INSERT], MaxLatency(us), 775167
[INSERT], 95thPercentileLatency(us), 221
[INSERT], 99thPercentileLatency(us), 333
[INSERT], Return=OK, 150000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-17 17:49:30:542 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-17 17:49:40:506 10 sec: 26056 operations; 2605.6 current ops/sec; est completion in 48 seconds [INSERT: Count=26060, Max=3411967, Min=107, Avg=353.36, 90=270, 99=800, 99.9=4711, 99.99=11991] 
2018-12-17 17:49:50:506 20 sec: 103959 operations; 7790.3 current ops/sec; est completion in 9 second [INSERT: Count=77899, Max=87167, Min=94, Avg=125.82, 90=145, 99=223, 99.9=1118, 99.99=6659] 
2018-12-17 17:49:58:761 28 sec: 150000 operations; 5578.02 current ops/sec; [CLEANUP: Count=1, Max=2015, Min=2015, Avg=2015, 90=2015, 99=2015, 99.9=2015, 99.99=2015] [INSERT: Count=46041, Max=712703, Min=88, Avg=176.74, 90=173, 99=284, 99.9=1454, 99.99=8927] 
[OVERALL], RunTime(ms), 28265
[OVERALL], Throughput(ops/sec), 5306.916681408102
[TOTAL_GCS_PS_Scavenge], Count, 51
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 80
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2830355563417654
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 51
[TOTAL_GC_TIME], Time(ms), 80
[TOTAL_GC_TIME_%], Time(%), 0.2830355563417654
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2015.0
[CLEANUP], MinLatency(us), 2015
[CLEANUP], MaxLatency(us), 2015
[CLEANUP], 95thPercentileLatency(us), 2015
[CLEANUP], 99thPercentileLatency(us), 2015
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 180.97822666666667
[INSERT], MinLatency(us), 88
[INSERT], MaxLatency(us), 3411967
[INSERT], 95thPercentileLatency(us), 226
[INSERT], 99thPercentileLatency(us), 335
[INSERT], Return=OK, 150000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-17 20:08:55:606 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-17 20:09:05:524 10 sec: 39295 operations; 3929.11 current ops/sec; est completion in 29 seconds [INSERT: Count=39295, Max=1032191, Min=92, Avg=230.52, 90=253, 99=623, 99.9=3999, 99.99=8767] 
2018-12-17 20:09:15:524 20 sec: 104866 operations; 6557.1 current ops/sec; est completion in 9 second [INSERT: Count=65571, Max=903167, Min=89, Avg=149.79, 90=165, 99=255, 99.9=1366, 99.99=7051] 
2018-12-17 20:09:22:242 26 sec: 150000 operations; 6718.37 current ops/sec; [CLEANUP: Count=1, Max=2517, Min=2516, Avg=2517, 90=2517, 99=2517, 99.9=2517, 99.99=2517] [INSERT: Count=45134, Max=26239, Min=89, Avg=146.58, 90=181, 99=289, 99.9=2012, 99.99=5959] 
[OVERALL], RunTime(ms), 26719
[OVERALL], Throughput(ops/sec), 5613.982559227516
[TOTAL_GCS_PS_Scavenge], Count, 53
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 87
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3256109884351959
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 53
[TOTAL_GC_TIME], Time(ms), 87
[TOTAL_GC_TIME_%], Time(%), 0.3256109884351959
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2517.0
[CLEANUP], MinLatency(us), 2516
[CLEANUP], MaxLatency(us), 2517
[CLEANUP], 95thPercentileLatency(us), 2517
[CLEANUP], 99thPercentileLatency(us), 2517
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 169.97075333333333
[INSERT], MinLatency(us), 89
[INSERT], MaxLatency(us), 1032191
[INSERT], 95thPercentileLatency(us), 239
[INSERT], 99thPercentileLatency(us), 337
[INSERT], Return=OK, 150000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-17 22:26:13:139 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-17 22:26:23:066 10 sec: 31723 operations; 3172.3 current ops/sec; est completion in 38 seconds [INSERT: Count=31723, Max=2344959, Min=100, Avg=290.68, 90=229, 99=546, 99.9=5099, 99.99=10943] 
2018-12-17 22:26:33:066 20 sec: 90309 operations; 5858.6 current ops/sec; est completion in 14 seconds [INSERT: Count=58586, Max=22863, Min=91, Avg=135.86, 90=165, 99=242, 99.9=1125, 99.99=6195] 
2018-12-17 22:26:42:300 29 sec: 150000 operations; 6464.96 current ops/sec; [CLEANUP: Count=1, Max=2044, Min=2044, Avg=2044, 90=2044, 99=2044, 99.9=2044, 99.99=2044] [INSERT: Count=59691, Max=2985983, Min=90, Avg=183.94, 90=163, 99=250, 99.9=1087, 99.99=4731] 
[OVERALL], RunTime(ms), 29241
[OVERALL], Throughput(ops/sec), 5129.783523135324
[TOTAL_GCS_PS_Scavenge], Count, 52
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 81
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2770083102493075
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 52
[TOTAL_GC_TIME], Time(ms), 81
[TOTAL_GC_TIME_%], Time(%), 0.2770083102493075
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2044.0
[CLEANUP], MinLatency(us), 2044
[CLEANUP], MaxLatency(us), 2044
[CLEANUP], 95thPercentileLatency(us), 2044
[CLEANUP], 99thPercentileLatency(us), 2044
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 187.73372666666666
[INSERT], MinLatency(us), 90
[INSERT], MaxLatency(us), 2985983
[INSERT], 95thPercentileLatency(us), 210
[INSERT], 99thPercentileLatency(us), 328
[INSERT], Return=OK, 150000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=150000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-18 00:02:33:411 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-18 00:02:43:389 10 sec: 52076 operations; 5207.6 current ops/sec; est completion in 19 seconds [INSERT: Count=52076, Max=300031, Min=93, Avg=174.71, 90=221, 99=458, 99.9=2943, 99.99=8991] 
2018-12-18 00:02:53:389 20 sec: 105875 operations; 5379.9 current ops/sec; est completion in 9 second [INSERT: Count=53799, Max=17935, Min=93, Avg=139.67, 90=165, 99=251, 99.9=1314, 99.99=7951] 
2018-12-18 00:03:03:389 30 sec: 148459 operations; 4258.4 current ops/sec; est completion in 1 second [INSERT: Count=42584, Max=6578175, Min=90, Avg=287.54, 90=163, 99=241, 99.9=668, 99.99=6659] 
2018-12-18 00:03:03:640 30 sec: 150000 operations; 6139.44 current ops/sec; [CLEANUP: Count=1, Max=3211, Min=3210, Avg=3211, 90=3211, 99=3211, 99.9=3211, 99.99=3211] [INSERT: Count=1541, Max=10719, Min=111, Avg=156.93, 90=177, 99=294, 99.9=538, 99.99=10719] 
[OVERALL], RunTime(ms), 30255
[OVERALL], Throughput(ops/sec), 4957.858205255329
[TOTAL_GCS_PS_Scavenge], Count, 22
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 75
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2478929102627665
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 22
[TOTAL_GC_TIME], Time(ms), 75
[TOTAL_GC_TIME_%], Time(%), 0.2478929102627665
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3211.0
[CLEANUP], MinLatency(us), 3210
[CLEANUP], MaxLatency(us), 3211
[CLEANUP], 95thPercentileLatency(us), 3211
[CLEANUP], 99thPercentileLatency(us), 3211
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 193.99078666666668
[INSERT], MinLatency(us), 90
[INSERT], MaxLatency(us), 6578175
[INSERT], 95thPercentileLatency(us), 217
[INSERT], 99thPercentileLatency(us), 321
[INSERT], Return=OK, 150000